{
    "auto_mapping": null,
    "base_model_name_or_path": null,
    "encoder_hidden_size": 3072,
    "inference_mode": false,
    "num_attention_heads": 24,
    "num_layers": 28,
    "num_transformer_submodules": 1,
    "num_virtual_tokens": 200,
    "peft_type": "PREFIX_TUNING",
    "prefix_projection": false,
    "revision": null,
    "task_type": "SEQ_CLS",
    "token_dim": 3072,
    "target_modules": [
        "v_proj",
        "q_proj"
    ]
}